<?php
include_once "header.php";


//*********************  انصال به دیتابیس *****************//

// اتصال به دیتابیس این دستور منصوق شده   = () mysql

// mysqli () = میتونیم از این دستور استفاده کنیم و هنوز هم استفاده میشه

// pdo = است php است که یک کلاس اماده در  pdo بهترین روش و امن ترین روش برای اتصال به دیتابیس

function connect_db(){

$server = "mysql:host=localhost;dbname=my_data;charset=utf8;";//  mysql = اول مشخص میکنیم به چه دیتابیسی میخواییم متصل بشیم
// بعد دو نقطه و اسم دیتابیس رو مینویسیم ک همیشه برابر با localhost است
// بعد نام دیتابیسی که ساختیم و میخواییم بهش متصل بشیم رو وارد میکنیم (my_data)
$name_db = "root";  // یوزرنیم ورود به دیتابیس رو مشخص میکنیم که پیشفرض root است ولی میتونیم تغییرش بدیم
$password_db = "";  //  پسورد که برای ورود به دیتابیس مشخص کردیم رو قرار میدیم که پیشفرض خالیه اگر برای دیتابیس پسفورد گذاشتیم باید داخل کتشن قرار بدیم
//$abj=new PDO($server,$name_db,$password_db);
// بخاطر این که از خطاهای pdo جلوگیری کنیم اونو داخل دستور try catch بنویسیم

try {
    //میگه سعی کن دستور زیر رو انجام بدی اگه خطا داشت چیزی نمایش نده برو قسمت catch رو انجام بده
    $pdo = new PDO($server, $name_db, $password_db);
    //echo "اتصال به دیتابیس با موفقیت انجام شد"."<br>";
}
catch (Exception $e){
    echo $e->getMessage(); // ارور ایجاد شده رو به ما نمایش میده
}
return $pdo;
}


//******************  نمایش اپشن های مای اسکیوعل از کد های زیر استفاده میکنیم *************
/*
$query= $pdo->prepare("SELECT * FROM users_tbl"); // داخل prepare میتونیم کدهای sql استفاده بنویسیم$query->execute();  //  کد رو اجرا میکنه
$abj=$query->fetchAll(pdo::FETCH_OBJ); //fetch all اپشن های جدول رو به صورت ارایه میاره
// نکته : برای استفاده از مقدار اپشن ها باید اون رو از ارایه به ابجکت تبدیل کنیم با استفاده از (pdo::fetch_obj)

// برای اینکه تمام مقادیر پشت سر هم چاپ بشن از حلقه foreach استفاده میکنیم
foreach ($abj as $text){
echo $text->username."__".$text->email."__ ".$text->password;
    echo "<br>";

}
*/
